#程式說明:
#測試以下IP位址port號在執行本地中，防火牆是否開通
#注意 以下行末有1個pipeline "|"，請勿刪除
"10.230.214.35:1191","10.230.214.35:2191","10.230.214.35:3191","10.230.214.36:1191","10.230.214.36:2191","10.230.214.36:3191","10.230.214.37:1191","10.230.214.37:2191","10.230.214.37:3191","10.230.214.38:1191","10.230.214.38:2191","10.230.214.38:3191","10.230.214.39:1191","10.230.214.39:2191","10.230.214.39:3191","10.230.212.148:22","10.230.212.147:22","10.230.215.21:22","10.230.215.22:22"|
ForEach-Object {
    $ErrorActionPreference = "SilentlyContinue"
    Clear-Variable socket
    $server = $_ -Split ":"
    $socket = New-Object System.Net.Sockets.TcpClient($server[0], $server[1]) `
      -ErrorVariable socketError
    if ($socket -ne $null) {$_ + " is UP"; $socket.Close()}
    else                   {$_ + " is DOWN"}
}